
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)     
	
	Поля.Добавить("Наименование");
	Поля.Добавить("ДействуетНаОсновании");
	СтандартнаяОбработка = Ложь  
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)    
	
	Представление = ?(ЗначениеЗаполнено(Данные.ДействуетНаОсновании), 
	                  СтрШаблон("%1 (на осн. %2)", Данные.Наименование, Данные.ДействуетНаОсновании), 
					  Данные.Наименование); 
	СтандартнаяОбработка = Ложь 

КонецПроцедуры

#КонецОбласти

#КонецЕсли
