#Область ПрограммныйИнтерфейс

Процедура ДополнитьФорму(Форма) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоПослеДоговораВГруппу(Форма);	  
		ДобавитьГруппуСкидка(Форма);               
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоПослеДоговораВГруппу(Форма);	
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоПослеДоговораВГруппу(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда       
		ДобавитьПолеКонтактноеЛицоПослеДоговора(Форма);	   
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда       
		ДобавитьПолеКонтактноеЛицоПослеДоговора(Форма);			
	КонецЕсли;
	
КонецПроцедуры        

Процедура ДобавитьПолеКонтактноеЛицоПослеДоговоравГруппу(Форма)
	
	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДК_КонтактноеЛицо";
	
КонецПроцедуры    

Процедура ДобавитьПолеКонтактноеЛицоПослеДоговора(Форма)
	
	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), , Форма.Элементы.СуммаДокумента);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДК_КонтактноеЛицо";
	
КонецПроцедуры  

Процедура ДобавитьГруппуСкидка(Форма)
	
	ГруппаСкидка = Форма.Элементы.Добавить("ГруппаОбычная", Тип("ГруппаФормы"), Форма.Элементы.ГруппаШапкаЛево);
	ГруппаСкидка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСкидка.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаСкидка.ОтображатьЗаголовок = Ложь; 
	ГруппаСкидка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;   
	
	ПолеВвода = Форма.Элементы.Добавить("СогласованнаяСкидка", Тип("ПолеФормы"), ГруппаСкидка);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДК_СогласованнаяСкидка";   
	ПолеВвода.УстановитьДействие("ПриИзменении", "ДК_СогласованнаяСкидкаПриИзменении");
	
	КомандаПересчет = Форма.Команды.Добавить("Пересчет");
	КомандаПересчет.Действие = "ДК_КомандаПересчет";	
	КомандаПересчет.Отображение = ОтображениеКнопки.КартинкаИТекст;   
	КомандаПересчет.Подсказка = "Пересчет суммы";
	
	КнопкаПересчет = Форма.Элементы.Добавить("Пересчет", Тип("КнопкаФормы"), ГруппаСкидка);
	КнопкаПересчет.Заголовок = "Пересчет";                                          
	КнопкаПересчет.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	КнопкаПересчет.Картинка = БиблиотекаКартинок.Обновить;
	КнопкаПересчет.ИмяКоманды = "Пересчет";	
	
КонецПроцедуры

#КонецОбласти
